Repository: Rawleenc/ArchCraftsman
Catalog: archcraftsman/locales/*.po
Languages: french

source: Automatic partitioning :
french: Partitionnement automatique :

source: Do you want to install Arch Linux next to other systems ?
french: Voulez-vous installer Arch Linux à côté des autres systèmes ?

source: What type of Swap do you want ? (%s) :
french: Quel type de swap voulez-vous ? (%s) :

source: Swap type '%s' is not supported.
french: Le type de swap '%s' n'est pas supporté.

source: Supported Swap types :
french: Types de swap supportés :

source: Do you want a separated Home ?
french: Voulez-vous un Home séparé ?

source: Do you want to encrypt the %s partition ?
french: Voulez-vous chiffrer la partition %s ?

source: Summary of choices :
french: Résumé des choix :

source: Swapfile size : %s
french: Taille du fichier d'échange : %s

source: Is the information correct ?
french: Les informations sont-elles correctes ?

source: Do you want to change the partitioning mode ?
french: Voulez-vous changer de mode de partitionnement ?

source: Querying IP geolocation information...
french: Interrogation des informations de géolocalisation IP...

source: Welcome to ArchCraftsman !
french: Bienvenue sur ArchCraftsman !

source: BIOS detected ! The script will act accordingly. Don't forget to select a DOS label type before partitioning.
french: BIOS détecté ! Le script agira en conséquence. N'oubliez pas de sélectionner un label type DOS avant de partitionner.

source: Environment configuration :
french: Configuration de l'environnement :

source: Choose your installation's language (%s) :
french: Choisissez la langue de votre installation (%s) :

source: Global language '%s' is not supported.
french: La langue globale '%s' n'est pas prise en charge.

source: Supported languages :
french: Langues prises en charge :

source: Your installation's language : %s
french: La langue de votre installation : %s

source: Your installation's keymap : %s
french: La keymap de votre installation : %s

source: System configuration :
french: Configuration du système :

source: What will be your hostname (archlinux) :
french: Quel sera votre nom d'hôte (archlinux) :

source: Choose your kernel (%s) :
french: Choisissez votre kernel (%s) :

source: Kernel '%s' is not supported.
french: Le kernel '%s' n'est pas supporté.

source: Supported kernels :
french: Kernels pris en charge :

source: Install a desktop environment ? (%s) :
french: Installer un environnement de bureau ? (%s) :

source: Desktop environment '%s' is not supported.
french: L'environnement de bureau '%s' n'est pas pris en charge.

source: Supported desktop environments :
french: Environnements de bureau supportés :

source: Choose your network stack (%s) :
french: Choisissez votre pile réseau (%s) :

source: Network stack '%s' is not supported.
french: La pile réseau '%s' n'est pas supporté.

source: Supported network stacks :
french: Pile réseau supportés :

source: Install proprietary Nvidia driver ?
french: Installer le pilote propriétaire Nvidia ?

source: Install terminus console font ?
french: Installer la police de console Terminus ?

source: Install Cups ?
french: Installer Cups ?

source: Install ZSH with GRML configuration ?
french: Installer ZSH avec la configuration GRML ?

source: If yes, the script will install the ZSH shell with GRML configuration. GRML is a ZSH pre-configuration used by Archlinux's live environment.
french: Si oui, le script installera le shell ZSH avec la configuration GRML. GRML est une pré-configuration de ZSH utilisée par l'environnement live d'Archlinux.

source: Install a set of main fonts ?
french: Installer un ensemble de polices principales ?

source: If yes, the following packages will be installed : %s
french: Si oui, les paquets suivants seront installés : %s

source: Install main file systems support ?
french: Installer le support des systèmes de fichiers principaux ?

source: Install and enable ZRAM ?
french: Installer et activer ZRAM ?

source: ZRAM is a process to compress datas directly in the RAM instead of moving them in a swap. Enabled ZRAM will allow you to compress up to half of your RAM before having to swap. This method is more efficient than the swap and do not use your disk but is more CPU demanding. ZRAM is fully compatible with a swap, it just has a higher priority.
french: ZRAM est un procédé permettant de compresser les données directement dans la RAM au lieu de les déplacer dans un swap. L'activation de ZRAM vous permettra de compresser jusqu'à la moitié de votre RAM avant de devoir swap. Cette méthode est plus efficace que le swap et n'utilise pas votre disque mais est plus gourmande en ressources CPU. ZRAM est entièrement compatible avec un swap, il a juste une priorité plus élevée.

source: Install PipeWire ?
french: Installer PipeWire ?

source: If yes, the PipeWire multimedia framework will be installed to manage audio and video capture.
french: Si oui, le framework multimédia PipeWire sera installé pour gérer l'audio et la capture vidéo.

source: Copy ArchCraftsman to the new system ?
french: Copier ArchCraftsman sur le nouveau système ?

source: Your timezone (%s) :
french: Votre fuseau horaire (%s) :

source: Would you like to add a user? (type username, leave blank if none) :
french: Voulez-vous ajouter un utilisateur ? (tapez le nom d'utilisateur, laissez vide si vous n'en avez pas) :

source: Invalid user name.
french: Nom d'utilisateur invalide.

source: What is the %s's full name (type the entire full name, leave blank if none) :
french: Quel est le nom complet de %s (tapez le nom complet, laissez un blanc si vous n'en avez pas) :

source: %s password configuration :
french: Configuration du mot de passe de %s :

source: Enter the %s password :
french: Entrez le mot de passe de %s :

source: Your hostname : %s
french: Votre nom d'hôte : %s

source: Your timezone : %s
french: Votre fuseau horaire : %s

source: Additional user name : %s
french: Nom d'utilisateur supplémentaire : %s

source: User's full name : %s
french: Nom complet de l'utilisateur : %s

source: More packages to install : %s
french: Plus de paquets à installer : %s

source: The display manager to install is '%s'. Do you want to install it ?
french: Le gestionnaire d'affichage à installer est '%s'. Voulez-vous l'installer ?

source: Desktop environment : %s
french: Environnement de bureau : %s

source: Display manager : %s
french: Gestionnaire d'affichage : %s

source: none
french: aucun

source: Copy ArchCraftsman to the new system.
french: Copier ArchCraftsman sur le nouveau système.

source: Install Cups.
french: Installer Cups.

source: Install a minimal environment.
french: Installer un environnement minimal.

source: Install a minimal environment ?
french: Installer un environnement minimal ?

source: If yes, the script will not install any extra packages, only base packages.
french: Si oui, le script n'installera pas de paquets supplémentaires, seulement les paquets de base.

source: Install ZSH with GRML configuration.
french: Installer ZSH avec la configuration GRML.

source: Install Iwd.
french: Installer Iwd.

source: Install Linux current kernel.
french: Installer le noyau Linux current.

source: Install Linux hardened kernel.
french: Installer le noyau Linux hardened.

source: Install Linux LTS kernel.
french: Installer le noyau Linux LTS.

source: Install Linux zen kernel.
french: Installer le noyau Linux zen.

source: Install main file systems support.
french: Installer le support des systèmes de fichiers principaux.

source: Install a set of main fonts.
french: Installer un ensemble de polices principales.

source: Microcodes to install : %s
french: Microcodes à installer : %s

source: Install NetworkManager.
french: Installer NetworkManager.

source: Install proprietary Nvidia driver.
french: Installer le pilote propriétaire Nvidia.

source: Install PipeWire.
french: Installer PipeWire.

source: Install Wayland support for the plasma session.
french: Installer le support Wayland pour la session plasma.

source: Install Wayland support for the plasma session ?
french: Installer le support Wayland pour la session plasma ?

source: Enable systemd network stack.
french: Activer la pile réseau de systemd.

source: Install terminus console font.
french: Installer la police de console Terminus.

source: Install YAY.
french: Installer YAY.

source: You must not be root to install yay.
french: Vous devez ne pas être root pour installer yay.

source: Install and enable ZRAM.
french: Installer et activer ZRAM.

source: Swapfile size ? (%s, type '0' for none) :
french: Taille du fichier d'échange ? (%s, tapez '0' pour aucun) :

source: Partitioning :
french: Partitionnement :

source: Do you want an automatic partitioning ?
french: Voulez-vous un partitionnement automatique ?

source: Updating mirrors...
french: Mise à jour des miroirs...

source: Installation of the base...
french: Installation de la base...

source: System configuration...
french: Configuration du système...

source: Locales configuration...
french: Configuration des locales...

source: Installation of the remaining packages...
french: Installation des paquets restants...

source: Creation and activation of the swapfile...
french: Création et activation du fichier d'échange...

source: Generating fstab...
french: Génération du fstab...

source: Desktop configuration...
french: Configuration du bureau...

source: Network configuration...
french: Configuration du réseau...

source: Installation and configuration of the grub...
french: Installation et configuration du grub...

source: Users configuration...
french: Configuration des utilisateurs...

source: Root account configuration...
french: Configuration du compte Root...

source: %s account configuration...
french: Configuration du compte %s...

source: Extra packages configuration if needed...
french: Configuration de paquets supplémentaires si nécessaire...

source: Installation complete ! You can reboot your system.
french: L'installation est terminée ! Vous pouvez redémarrer votre système.

source: Script execution interrupted by the user !
french: Exécution du script interrompue par l'utilisateur !

source: A subprocess execution failed ! See the following error: %s
french: L'exécution d'un sous-processus a échoué ! L'erreur suivante s'est produite : %s

source: This script must be run as root.
french: Ce script doit être exécuté en tant que root.

source: Running pre-launch steps :
french: Exécution des étapes de pré-lancement :

source: Synchronising repositories...
french: Synchronisation des dépôts...

source: Manual partitioning :
french: Partitionnement manuel :

source: Partitioned drives so far : %s
french: Disques partitionnés jusqu'à présent : %s

source: Do you want to partition an other drive ?
french: Voulez-vous partitionner un autre disque ?

source: Detected target drive partitions : %s
french: Partitions du disque cible détectées : %s

source: What is the role of this partition ? (%s) :
french: Quel est le rôle de cette partition ? (%s) :

source: Partition type '%s' is not supported.
french: Le type de partition '%s' n'est pas supporté.

source: Supported partition types :
french: Types de partition supportés :

source: What is the mounting point of this partition ? :
french: Quel est le point de montage de cette partition ? :

source: The EFI partition is required for system installation.
french: La partition EFI est nécessaire pour l'installation du système.

source: The Root partition is required for system installation.
french: La partition Root est nécessaire pour l'installation du système.

source: The Boot partition is required for system installation.
french: La partition Boot est nécessaire pour l'installation du système.

source: Install more packages ? (type extra packages full names, example : 'htop neofetch', leave blank if none) :
french: Installer d'autres paquets ? (tapez les noms complets des paquets supplémentaires, exemple : 'htop neofetch', laissez vide si vous n'en avez pas) :

source: Package %s doesn't exist.
french: Le paquet %s n'existe pas.

source: Format the partition ?
french: Formater la partition ?

source: Do you want to encrypt this partition ?
french: Voulez-vous chiffrer cette partition ?

source: yes
french: oui

source: no
french: non

source: %s : %s (mounting point : %s, format %s, format type %s)
french: %s : %s (point de montage : %s, formater %s, type de formatage %s)

source: encrypted
french: chiffrée

source: Formatting %s...
french: Formatage de %s...

source: Opening %s...
french: Ouverture de %s...

source: Mounting %s...
french: Montage de %s...

source: Unmounting %s...
french: Démontage de %s...

source: Closing %s...
french: Fermeture de %s...

source: Formatting and mounting partitions...
french: Formatage et montage des partitions...

source: Unmounting partitions...
french: Démontage des partitions...

source: Configuring live environment...
french: Configuration de l'environnement live...

source: Bundle '%s' is not supported.
french: Le bundle '%s' n'est pas supporté.

source: Available bundles :
french: Bundles disponibles :

source: Shell bundle '%s' is not supported.
french: Le bundle shell '%s' n'est pas supporté.

source: Available shell bundles :
french: Bundles shell disponibles :

source: ArchCraftsman interactive shell mode.
french: Mode shell interactif d'ArchCraftsman.

source: Available commands :
french: Commandes disponibles :

source: Command '%s' is not supported.
french: La commande '%s' n'est pas supporté.

source: Sub-command '%s' is not supported.
french: La sous-commande '%s' n'est pas supporté.

source: Available sub-commands :
french: Sous-commandes disponibles :

source: Press any key to continue...
french: Appuyez sur n'importe quelle touche pour continuer...

source: Help :
french: Aide :

source: The input must not be empty.
french: La saisie ne doit pas être vide.

source: Type your installation's keymap, or 'help' to get the list of keymaps (%s) :
french: Entrez la keymap de votre installation, ou 'help' pour obtenir la liste des keymaps (%s) :

source: Keymap '%s' doesn't exist.
french: La keymap '%s' n'existe pas.

source: Which format type do you want ? (%s) :
french: Quel type de formatage voulez-vous ? (%s) :

source: Format type '%s' is not supported.
french: Le type de formatage '%s' n'est pas supporté.

source: Supported format types :
french: Types de formatage supportés :

source: What will be the encrypted block name ? :
french: Quel sera le nom de bloc chiffré ? :

source: Invalid encrypted block name.
french: Nom de bloc chiffré invalide.

source: Enter it again to confirm :
french: Saisissez le à nouveau pour confirmer :

source: Passwords entered don't match.
french: Les mots de passe saisis ne correspondent pas.

source: Detected drives :
french: Disques détectés :

source: On which drive should Archlinux be installed ? (type the entire name, for example '/dev/sda') :
french: Sur quel disque Archlinux doit-il être installé ? (tapez le nom complet, par exemple '/dev/sda') :

source: The target drive '%s' doesn't exist.
french: Le disque cible '%s' n'existe pas.
